{"class_name": "Model", "config": {"name": "model_4", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 56, 46], "dtype": "float32", "sparse": false, "name": "input_19"}, "name": "input_19", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 56, 46], "dtype": "float32", "sparse": false, "name": "input_20"}, "name": "input_20", "inbound_nodes": []}, {"class_name": "Sequential", "config": {"name": "sequential_9", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "batch_input_shape": [null, 1, 56, 46], "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_8", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}}, {"class_name": "Dropout", "config": {"name": "dropout_12", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}}, {"class_name": "Dropout", "config": {"name": "dropout_13", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "name": "sequential_9", "inbound_nodes": [[["input_19", 0, 0, {}]], [["input_20", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAcAAABDAAAAcygAAAB8AC8CfQF9AnQAoAF0AGoCdACgA3wBfAIYAKEBZAFk\nAmQDjQOhAVMAKQRO6QEAAABUKQLaBGF4aXPaCGtlZXBkaW1zKQTaAUvaBHNxcnTaA3N1bdoGc3F1\nYXJlKQPaBXZlY3Rz2gF42gF5qQByCwAAAPogPGlweXRob24taW5wdXQtMTA0LTQ0N2ZmNTk1YWIy\nMz7aEmV1Y2xpZGVhbl9kaXN0YW5jZQEAAABzBAAAAAABCAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": ["4wEAAAAAAAAAAwAAAAIAAABDAAAAcxQAAAB8AC8CfQF9AnwBZAEZAGQCZgJTACkDTukAAAAA6QEA\nAACpACkD2gZzaGFwZXPaBnNoYXBlMdoGc2hhcGUycgMAAAByAwAAAPogPGlweXRob24taW5wdXQt\nMTA0LTQ0N2ZmNTk1YWIyMz7aFmV1Y2xfZGlzdF9vdXRwdXRfc2hhcGUGAAAAcwQAAAAAAQgB\n", null, null], "output_shape_type": "lambda", "output_shape_module": "__main__", "arguments": {}}, "name": "lambda_6", "inbound_nodes": [[["sequential_9", 1, 0, {}], ["sequential_9", 2, 0, {}]]]}], "input_layers": [["input_19", 0, 0], ["input_20", 0, 0]], "output_layers": [["lambda_6", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}